In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('https://www.sharkattackfile.net/spreadsheets/GSAF5.xls')
df.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Species,Source,pdf,href formula,href,Case Number,Case Number.1,original order,Unnamed: 21,Unnamed: 22
0,15 Mar 2024,2024.0,Unprovoked,AUSTRALIA,Queensland,Bargara Beach,Swimming,Brooklyn Sauer,F,13,...,Tiger shark,"Yahoo News, 3/15/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,04 Mar 2024,2024.0,Unprovoked,USA,Hawaii,"Old Man's, Waikiki",Surfing,Matthew White,M,NaN,...,Tiger shark 8',"Surfer, 3/6/2024F",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,02 Mar-2024,2024.0,Unprovoked,USA,Hawaii,"Rainbows, Oahu",Swimming,NaN,F,11,...,3' to 4' shark,"Hawaii News Now, 3/4/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,25 Feb-2024,2024.0,Unprovoked,AUSTRALIA,Western Australia,"Sandlnd Island, Jurian Bay",NaN,female,F,46,...,Tiger shark,"WA Today, 2/26/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,14 Feb-2024,2024.0,Unprovoked,INDIA,Maharashtra,"Vaitarna River, Palghar District",Fishing,Vicky Suresh Govari,M,32,...,"Bull shark, 7'","Times of India, 2/14/2024",NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [6]:
#check datatypes
df.dtypes

Date               object
Year              float64
Type               object
Country            object
State              object
Location           object
Activity           object
Name               object
Sex                object
Age                object
Injury             object
Unnamed: 11        object
Time               object
Species            object
Source             object
pdf                object
href formula       object
href               object
Case Number        object
Case Number.1      object
original order    float64
Unnamed: 21        object
Unnamed: 22        object
dtype: object

In [7]:
#nr rows, nr columns
df.shape

(6969, 23)

In [9]:
df_cols = df.columns
df_cols

Index(['Date', 'Year', 'Type', 'Country', 'State', 'Location', 'Activity',
       'Name', 'Sex', 'Age', 'Injury', 'Unnamed: 11', 'Time', 'Species ',
       'Source', 'pdf', 'href formula', 'href', 'Case Number', 'Case Number.1',
       'original order', 'Unnamed: 21', 'Unnamed: 22'],
      dtype='object')

In [10]:
#split dataset into categorical and numerical
categorical_data = df[["Type","Country","State","Location","Activity","Name","Sex","Injury","Unnamed: 11","Source"]]
numerical_data = df[["Date","Year","Age","Time"]]

In [ ]:
#basic statistics for categorical_data:
categorical_data.describe()

,Type,Country,State,Location,Activity,Name,Sex,Injury,Unnamed: 11,Source
count,6926,6894,6462,6379,6358,6724,6365,6909,6382,6925
unique,12,225,902,4514,1587,5683,8,4079,12,5302
top,Unprovoked,USA,Florida,"New Smyrna Beach, Volusia County",Surfing,male,M,FATAL,N,"K. McMurray, TrackingSharks.com"
freq,5107,2538,1178,191,1121,680,5578,863,4832,131

In [ ]:
#describe the unique values of each categorical column 
categorical_data.nunique()

Type             12
Country         225
State           902
Location       4514
Activity       1587
Name           5683
Sex               8
Injury         4079
Unnamed: 11      12
Source         5302
dtype: int64

In [ ]:
#basic statistics for numerical_data:
numerical_data.describe()

              Year
count  6942.000000
mean   1934.403342
std     272.920956
min       0.000000
25%    1947.000000
50%    1985.000000
75%    2009.000000
max    2024.000000

In [ ]:
numerical_data.nunique()

Date    6003
Year     259
Age      243
Time     410
dtype: int64

In [ ]:
#Explore Date
#Explore Year
date = df["Date"].value_counts()
date

Date
1957           9
1942           8
1958           7
No date        6
1956           6
              ..
07-Jul-2000    1
09-Jul-2000    1
10-Jul-2000    1
12-Jul-2000    1
1845-1853      1
Name: count, Length: 6003, dtype: int64

In [ ]:
date_sorted = date.sort_values() 
date_sorted   #need to convert 'str' and 'int'

Date
Reported 18-Jun- 1874    1
06-May-2021              1
03-Jul-2021              1
05-Jul-2021              1
Reported 11-Jul-2021     1
                        ..
1956                     6
No date                  6
1958                     7
1942                     8
1957                     9
Name: count, Length: 6003, dtype: int64

In [ ]:
date.dtypes

dtype('int64')

In [ ]:
#Explore Year
year = df["Year"].value_counts()
year_sorted = year.sort_index(ascending = False)
year_sorted

Year
2024.0     10
2023.0    108
2022.0     98
2021.0    109
2020.0    101
         ...
1500.0      1
1000.0      1
77.0        1
5.0         1
0.0       129
Name: count, Length: 259, dtype: int64

In [ ]:
year_sorted.tail()

Year
1500.0      1
1000.0      1
77.0        1
5.0         1
0.0       129
Name: count, dtype: int64

In [ ]:
#Data types of "Year"
year.dtypes

dtype('int64')

In [ ]:
#Explore "Type"
typeof = df["Type"].value_counts()
typeof_sorted = typeof.sort_index(ascending = False)
typeof_sorted

Type
Watercraft              355
Unverified                1
Unprovoked             5107
Under investigation       1
Unconfirmed               1
Sea Disaster            242
Questionable             22
Provoked                635
Invalid                 552
Boat                      7
?                         1
 Provoked                 2
Name: count, dtype: int64

In [ ]:
#Explore Country
country = df["Country"].value_counts()
country_sorted = country.sort_index(ascending = True)
country_sorted

Country
 PHILIPPINES          1
 TONGA                3
ADMIRALTY ISLANDS     1
AFRICA                1
ALGERIA               1
                     ..
VIETNAM              15
WEST INDIES           2
WESTERN SAMOA         1
YEMEN                 2
YEMEN                 7
Name: count, Length: 225, dtype: int64

In [ ]:
#Explore State
state = df["State"].value_counts()
state_sorted = state.sort_index(ascending = False)
state_sorted

State
d’Étang-Salé                  2
Zamboanga del Sur Province    3
Zambesi River                 1
Zadar County                  4
Yucatan Channel               1
                             ..
 Loyalty Islands              1
 Lau Province                 1
 La Libertad                  1
 Kikori River mouth           1
 Grand Bahama Island          1
Name: count, Length: 902, dtype: int64

In [ ]:
#Explore Location
location = df["Location"].value_counts()
location_sorted = location.sort_index(ascending = True)
location_sorted

Location
                                    1
 9 nm off Vila do Conde             1
 A pearl  farm in Roebuck Bay       1
 Ambatolaoka, Nosy Be Island        1
 Bellingen                          1
                                   ..
Île de Casey                        1
Île de Sable                        1
Île de Saint Simon, Glynn County    1
İnciralti Beach, İzmir              1
“Southern Wharf”                    1
Name: count, Length: 4514, dtype: int64

In [ ]:
#Explore Activity
activity = df["Activity"].value_counts()
activity_sorted = activity.sort_index(ascending = True)
activity_sorted

Activity
                                                                                  1
                                                                                  1
 Diving for abalone (Hookah)                                                      1
 a canoe was pursuing a schooner that had forcibily abducted 5 young girls        1
"Boat accident"                                                                   1
                                                                                 ..
ship torpedoed 400 miles off the African coas. Man was clinging to hatch cover    1
small boat                                                                        1
wreck of the State Oil Company ship Permina                                       1
yachting accident                                                                 1
yachtsman in a zodiac                                                             1
Name: count, Length: 1587, dtype: int64

In [ ]:
#Explore Name
name = df["Name"].value_counts()
name_sorted = name.sort_index(ascending = True)
name_sorted

Name
                        Maria Korcsmaros \n              1
 2 males                                                 2
 28' sport fishing boat, Bird Dog                        1
 7.6 m motorized boat, occupants: fisherman & his son    1
 Ben Tillman Homes                                       1
                                                        ..
young aboriginal male                                    1
young boy                                                1
young girl                                               1
young male                                               1
İbrahim Karagöz                                          1
Name: count, Length: 5683, dtype: int64

In [ ]:
#Explore value_counts in "Sex"
sex = categorical_data["Sex"].value_counts()
sex

Sex
M        5578
F         779
M           2
N           2
 M          1
lli         1
M x 2       1
.           1
Name: count, dtype: int64

In [ ]:
#Explore Age
age = df["Age"].value_counts()
age_sorted = age.sort_values(ascending = True)
age_sorted

Age
13 or 14     1
1            1
2½           1
31 or 33     1
10 or 12     1
            ..
15          84
17          85
17          88
16          89
19          89
Name: count, Length: 243, dtype: int64

In [14]:
#function with for loop to explore columns : 
def print_unique_value(column):
    for column in categorical_data:
        print(df[column].unique())
print_unique_value(print(f"(Column: {column}"))

NameError: name 'column' is not defined